app/views/gossip/index.html.erb

    <%@all_gossips.each do |elem|%>
    <%=elem.user.first_name%> : <%= elem.title%> : Commentaires : <%=elem.comments.count%> <br/>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]