app/views/gossip/new.html.erb

SELECT "tags".* FROM "tags"
---
      <label>Tags</label>
      <% Tag.all.each do |tag| %>