app/views/city/show.html.erb

<h2>Voici la liste de potins écrits dans cette ville : </h2><br/>
<%@city.gossips.each do |elem|%>
    <%=elem.user.first_name%> : <%=elem.title%> <br/>
---
SELECT "gossips".* FROM "gossips" INNER JOIN "users" ON "gossips"."user_id" = "users"."id" WHERE "users"."city_id" = $1  [["city_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]