app/controllers/comment_controller.rb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "gossip_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "asdkjweasd"], ["gossip_id", 1], ["created_at", "2023-05-11 15:01:53.935660"], ["updated_at", "2023-05-11 15:01:53.935660"], ["user_id", 11]]
---
  def create
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    if logged_in?
      @comment = Comment.new(
        'user_id' => current_user.id,
        'gossip_id' => @current_gossip.id,
        'content' => params[:content]
      )
      puts params
      if @comment.save

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["gossip_id", 16], ["id", 24], ["LIMIT", 1]]
---
  def edit
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @current_comment = @current_gossip.comments.find(params[:id].to_i)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["gossip_id", 1], ["id", 22], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "test"], ["updated_at", "2023-05-11 15:02:00.519342"], ["id", 22]]
---
  def update
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @current_comment = @current_gossip.comments.find(params[:id].to_i)
    comment_params = params.permit(:content)

    if !logged_in?
      redirect_to root_path(connection_failed: true)
    elsif @current_comment.user.id == current_user.id
      @current_comment.update(comment_params)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["gossip_id", 1], ["id", 22], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 22]]
---
  def destroy
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @current_comment = @current_gossip.comments.find(params[:id].to_i)

    if !logged_in?
      redirect_to root_path(connection_failed: true)
    elsif @current_comment.user.id == current_user.id
      @current_comment.destroy