app/controllers/gossip_controller.rb

  def index
    @all_gossips = Gossip.all
    @all_users = User.all
---
SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users"

  def create
    @gossip = Gossip.new('user_id' => current_user.id,
                   'title' => params[:title],
                   'content' => params[:content])
    if params[:tag_ids].present?
      params[:tag_ids].each do |tag_id|
        @gossip.intertags.build(tag_id: tag_id)
      end
    end
    if @gossip.save
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Testnew"], ["content", "dasdhjgqwyetjashdasd"], ["user_id", 11], ["created_at", "2023-05-11 14:37:45.808911"], ["updated_at", "2023-05-11 14:37:45.808911"]]
INSERT INTO "intertags" ("gossip_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["gossip_id", 21], ["tag_id", 3], ["created_at", "2023-05-11 14:37:45.817775"], ["updated_at", "2023-05-11 14:37:45.817775"]]

  def edit
    @current_gossip = Gossip.find(params[:id].to_i)
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]

  def show
    @current_gossip = Gossip.find(params[:id].to_i)
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update

    @current_gossip = Gossip.find(params[:id].to_i)

    gossip_params = params.permit(:title, :content)

  if !logged_in?
    redirect_to root_path(connection_failed: true)
  elsif @current_gossip.user.id == current_user.id
      @current_gossip.update(gossip_params)
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "modified"], ["updated_at", "2023-05-11 14:48:32.819891"], ["id", 22]]

  def destroy
    @current_gossip = Gossip.find(params[:id].to_i)


    if !logged_in?
      redirect_to root_path(connection_failed: true)
    elsif @current_gossip.user.id == current_user.id
      @current_gossip.destroy
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 21]]