app/controllers/user_controller.rb

INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    user = User.create(first_name: params[:first_name], last_name: params[:last_name], description: params[:description], age: params[:age], city_id: params[:city_id], email: params[:email], password: params[:password], password_confirmation: params[:password_confirmation])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    @current_user = User.find(params[:id].to_i)