app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "remember_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-05-12 13:41:39.048129"], ["remember_digest", "$2a$12$4yYtyqAFE1A47h3naL7zr.ul5c1HqdYQllf2BOlcnae11AcvDx27S"], ["id", 1]]
---
  def remember(remember_token)
    remember_digest = BCrypt::Password.create(remember_token)
    self.update(remember_digest: remember_digest)